yokosumei/Keryke-OS/kerike_concurs/firmware/esp32_keryke_ble/esp32_keryke_ble.ino
/**
 * KERYKE v3 — Nod de achiziție ESP32-S3 cu protocol binar peste BLE SECURIZAT
 * ============================================================================
 * Variantă Bluetooth a `esp32_keryke_tcp`: ACELAȘI protocol binar, dar transportul
 * este BLE (Bluetooth Low Energy) în locul TCP/WiFi. ESP32-S3 NU are Bluetooth
 * Classic (fără SPP/RFCOMM) — de aceea se folosește BLE GATT.
 *
 * SECURITATE (cerința „conexiune sigură cu parolă"):
 *   - Pairing cu PASSKEY FIX de 6 cifre (LE Secure Connections + MITM + Bonding).
 *     Centralul (Pi/telefon) TREBUIE să introducă PIN-ul corect; altfel pairing-ul
 *     eșuează și legătura se închide. => „nu poate fi împerecheat decât cu anumite
 *     dispozitive" (cele care cunosc PIN-ul).
 *   - Caracteristicile GATT cer link CRIPTAT + AUTENTIFICAT (ENC_MITM): fără pairing
 *     reușit nu curge niciun octet de protocol.
 *   - BONDING: cheile se salvează în NVS; dispozitivele împerecheate rămân
 *     recunoscute între reset-uri (nu mai cer PIN a doua oară). Un dispozitiv nou tot
 *     trebuie să treacă prin pairing cu PIN => „doar cine știe parola" se poate lega.
 *
 * Arhitectură (identică cu varianta TCP — decuplarea achiziției de rețea):
 *   - Core 1 (loop Arduino): achiziție senzori (MPU6050 + VL53L1X), integrare yaw,
 *     detecție fază de balans (gait-sync), control servo + motor vibrații. NU
 *     depinde de starea Bluetooth.
 *   - Stiva BLE (Bluedroid, tasks proprii pe core 0): advertising, pairing/bonding,
 *     GATT server, parser de protocol în callback-ul de WRITE, transmisie prin NOTIFY.
 *   - Task „ble_push" (core 0): emisie periodică nesolicitată (RSP_TELEMETRY_PUSH, 5 s).
 *   - Sincronizare: snapshot telemetrie protejat de portMUX (secțiune critică scurtă),
 *     comenzi actuator (servo/vibrații) prin coadă FreeRTOS.
 *
 * Pornire NERESTRICȚIONATĂ, dar SEMNALIZATĂ (senzori):
 *   - Eșecul de inițializare al MPU6050/VL53L1X NU blochează boot-ul: aplicația
 *     pornește degradat (fail-safe: „fără date ≠ liber"), BLE rămâne disponibil
 *     pentru diagnoză, iar senzorul e reîncercat periodic (auto-recovery).
 *   - Semnalizare pe LED-ul integrat al plăcii (LED_BUILTIN — pe DevKitC-1 este
 *     WS2812 RGB, expus de core drept RGB_BUILTIN), non-blocant, din loop():
 *       albastru continuu        = setup() în curs
 *       verde, puls scurt / 3 s  = ambii senzori OK (heartbeat discret)
 *       roșu, clipire 300 ms     = VL53L1X (ToF) indisponibil — critic pt. siguranță
 *       galben, clipire 300 ms   = MPU6050 (IMU) indisponibil
 *       roșu/galben alternat     = ambii senzori indisponibili
 *   - Semnal haptic la boot (utilizatorul final e nevăzător, nu vede LED-ul):
 *     3 pulsuri lungi = ToF picat; 2 pulsuri lungi = IMU picat (grupuri cu pauză).
 *
 * Protocol (cadru, IDENTIC cu varianta TCP): STX | OPCODE | LEN(uint16 LE) | PAYLOAD | ETX
 *   STX = 0x02, ETX = 0x03
 *   Un cadru complet încape într-o singură notificare BLE (MTU negociat 517).
 *
 * Opcode-uri (identice):
 *   0x10 CMD_GET_TELEMETRY   (Central -> ESP, LEN=0)
 *   0x11 RSP_TELEMETRY       (ESP -> Central, LEN=50) răspuns SOLICITAT
 *   0x12 RSP_TELEMETRY_PUSH  (ESP -> Central, LEN=50) emisie NESOLICITATĂ periodică (5 s)
 *   0x20 CMD_MOTOR_ROTATE    (Central -> ESP, LEN=2, int16 LE grade relative servo)
 *   0x22 CMD_SERVO_POSE      (Central -> ESP, LEN=2: poza[0/1/2] + mod[0=gait,1=imediat])
 *   0x23 CMD_VIBRATE         (Central -> ESP, LEN=3: intensitate[0..255] + durata_ms[uint16 LE])
 *   0x06 RSP_ACK             (ESP -> Central, LEN=3: opcode ecou + int16 valoare)
 *   0x15 RSP_NACK            (ESP -> Central, LEN=2: opcode ecou + cod eroare)
 *
 * GATT:
 *   Serviciu KERYKE                5f6d0001-9b5a-4c3d-8e2f-1a2b3c4d5e6f
 *     Caracteristică TX (NOTIFY)   5f6d0002-9b5a-4c3d-8e2f-1a2b3c4d5e6f  (ESP -> Central)
 *     Caracteristică RX (WRITE)    5f6d0003-9b5a-4c3d-8e2f-1a2b3c4d5e6f  (Central -> ESP)
 */

#include <BLEDevice.h>
#include <BLEServer.h>
#include <BLEUtils.h>
#include <BLE2902.h>
#include <BLESecurity.h>

#include <Wire.h>
#include <Adafruit_MPU6050.h>
#include <Adafruit_Sensor.h>
#include "Adafruit_VL53L1X.h"
#include <math.h>

// ============== ↓ CONFIGURARE BLUETOOTH ↓ ==============
static const char*    BLE_DEVICE_NAME = "KERYKE-ESP32";   // nume la advertising (vizibil la scanare)
// PAROLA (passkey de împerechere): fix, 6 cifre (000000..999999). Centralul TREBUIE
// să introducă exact această valoare la pairing. Schimb-o pentru dispozitivul tău.
static const uint32_t BLE_PASSKEY     = 123456;
// ============== ↑ CONFIGURARE BLUETOOTH ↑ ==============

// UUID-uri GATT (128-bit, fixe)
#define KERYKE_SERVICE_UUID "5f6d0001-9b5a-4c3d-8e2f-1a2b3c4d5e6f"
#define KERYKE_TX_UUID      "5f6d0002-9b5a-4c3d-8e2f-1a2b3c4d5e6f"  // NOTIFY: ESP -> Central
#define KERYKE_RX_UUID      "5f6d0003-9b5a-4c3d-8e2f-1a2b3c4d5e6f"  // WRITE : Central -> ESP

// ---------------- Hardware ----------------
TwoWire I2CMPU = TwoWire(0);
TwoWire I2CTOF = TwoWire(1);

#define MPU_SDA   41
#define MPU_SCL   42
#define TOF_SDA   39
#define TOF_SCL   40
#define IRQ_PIN   -1
#define XSHUT_PIN  35

// Servo (LEDC) — adaptați la actuatorul real (stepper: vezi applyMotorRotation)
#define SERVO_PIN      21
#define SERVO_LEDC_CH  0
#define SERVO_FREQ_HZ  50
#define SERVO_RES_BITS 14
#define SERVO_US_MIN   500
#define SERVO_US_MAX   2500

// Motor vibrații (LEDC PWM) — GPIO18 (non-strapping; poarta MOSFET)
#define VIBRATION_PIN      18
#define VIBRATION_LEDC_CH  1
#define VIBRATION_FREQ_HZ  5000
#define VIBRATION_RES_BITS 8         // 0..255

// LED de stare — LED-ul INTEGRAT al plăcii (pe ESP32-S3 DevKitC-1, LED_BUILTIN este
// un WS2812 RGB adresabil pe GPIO48; core-ul îl expune și ca RGB_BUILTIN, comandat
// cu rgbLedWrite() — culori). Semnalizare NON-BLOCANTĂ a stării senzorilor.
#ifdef RGB_BUILTIN
  #define STATUS_LED_PIN  RGB_BUILTIN   // WS2812 integrat (culori)
#else
  #define STATUS_LED_PIN  LED_BUILTIN   // fallback: LED simplu (doar on/off)
#endif
#define STATUS_LED_BRIGHTNESS 40        // 0..255 (WS2812 e orbitor la maxim)

// ============== ↓ CONFIGURARE LOGGING (la compilare) ↓ ==============
// LOG_ENABLED 0 => nicio ieșire pe consolă (toate macro-urile se compilează în gol).
// LOG_ENABLED 1 => logurile emise din contextul de TIMP REAL (core 1: loop/acqTask)
//   NU scriu direct pe UART (o linie [TELE] de ~230 caractere blochează ~20 ms la
//   115200); ele se pun într-o coadă și sunt tipărite de un task dedicat pe core 0
//   (logTask). Logurile din setup() și din task-urile de pe core 0 scriu direct
//   (acolo blocarea pe UART nu afectează bucla de timp real).
// LOG_HEXDUMP 1 => dump hexa [TX]/[RX] al cadrelor de protocol (diagnostic;
//   rulează în context BLE pe core 0). Cere LOG_ENABLED 1.
#define LOG_ENABLED  0
#define LOG_HEXDUMP  0
// ============== ↑ CONFIGURARE LOGGING (la compilare) ↑ ==============

// Poziții servo (grade) + temporizare gait-sync
#define SERVO_CENTER   90
#define SERVO_LEFT     45
#define SERVO_RIGHT    135
#define SERVO_HOLD_MS  2000          // menține poza, apoi revine la centru

// Detecție fază de balans (gait) din IMU
#define GAIT_WINDOW_SIZE      10
#define GAIT_ACCEL_DIP        0.5f   // scădere accel sub media ferestrei
#define GAIT_GYRO_PEAK        0.3f   // vârf |gyroZ| (rad/s)
#define MIN_SWING_INTERVAL_MS 500

// Vibrații: rampă lină (pentru CMD_VIBRATE)
#define VIBRATION_RAMP_STEP  8

// Ritm cardiac haptic la obstacol — perioada scade cu distanța (mai aproape = mai rapid)
#define HB_DIST_FAST_MM      500    // < 0.5 m  -> ritm alert (rapid)
#define HB_DIST_MEDIUM_MM    1000   // < 1.0 m  -> ritm mediu
#define HB_DIST_SLOW_MM      1500   // < 1.5 m  -> ritm lent  (>= 1.5 m => fără vibrații)
#define HB_PERIOD_FAST_MS    400    // ~150 bpm
#define HB_PERIOD_MEDIUM_MS  750    // ~80 bpm
#define HB_PERIOD_SLOW_MS    1100   // ~55 bpm
#define HB_LUB_MS    60             // durata bătăii principale "lub"
#define HB_GAP_MS    100            // pauza între lub și dub
#define HB_DUB_MS    50             // durata celei de-a doua bătăi "dub"
#define HB_LUB_LEVEL 230            // intensitate PWM "lub"
#define HB_DUB_LEVEL 160            // intensitate PWM "dub"

// VL53L1X — config + filtrare (aplicație critică: ghidare nevăzător)
#define TOF_DISTANCE_MODE     2     // 1 = SHORT (<=1.3m, robust la lumina), 2 = LONG (<=~4m)
#define TOF_TIMING_BUDGET_MS  50    // LONG cere buget mai mare (50-100ms) pt. rază/acuratețe
#define TOF_INTERMEAS_MS      55    // perioadă între măsurători (>= timing budget)
#define TOF_MEDIAN_N          5     // fereastra filtrului median (probe VALIDE)
#define TOF_STALE_MS          300   // fără probă validă atâta timp => distanță NECUNOSCUTĂ
#define TOF_RECOVER_MS        2000  // dacă senzorul e mut, reîncearcă reinițializarea la acest interval
#define TOF_POLL_MS           10    // interogarea dataReady() e o tranzacție I2C reală —
                                    // limitată la 10 ms (măsurătoare nouă apare oricum la TOF_INTERMEAS_MS)

