yokosumei/Keryke-OS/kerike_concurs/firmware/esp32_keryke_ble/esp32_keryke_ble.ino
// MPU6050 — dacă IMU e absent/mut, reîncearcă reinițializarea la acest interval
#define MPU_RECOVER_MS        5000

Adafruit_MPU6050  mpu;
Adafruit_VL53L1X  vl53 = Adafruit_VL53L1X(XSHUT_PIN, IRQ_PIN);

// ---------------- Protocol (IDENTIC cu varianta TCP) ----------------
static constexpr uint8_t  P_STX = 0x02;
static constexpr uint8_t  P_ETX = 0x03;
static constexpr uint16_t P_MAX_PAYLOAD = 256;
static constexpr uint32_t P_INTERBYTE_TIMEOUT_MS = 500;
static constexpr uint32_t P_TELEMETRY_PUSH_MS    = 300;//5000;  // emisie periodică nesolicitată catre Raspberry pi

enum Opcode : uint8_t {
  CMD_GET_TELEMETRY  = 0x10,
  RSP_TELEMETRY      = 0x11,   // răspuns solicitat
  RSP_TELEMETRY_PUSH = 0x12,   // emisie periodică nesolicitată (payload identic)
  CMD_MOTOR_ROTATE   = 0x20,   // rotație relativă servo (int16 grade)
  CMD_SERVO_POSE     = 0x22,   // poză servo (centru/stânga/dreapta) + mod gait/imediat
  CMD_VIBRATE        = 0x23,   // impuls motor vibrații (intensitate + durată)
  RSP_ACK            = 0x06,
  RSP_NACK           = 0x15,
};

enum NackCode : uint8_t {
  NACK_BAD_LENGTH     = 0x01,
  NACK_UNKNOWN_OPCODE = 0x02,
  NACK_MOTOR_BUSY     = 0x03,
};

#pragma pack(push, 1)
struct TelemetryPacket {          // 50 octeți, little-endian nativ
  uint32_t counter;               //  4
  uint8_t  angle;                 //  1  [0..180]  (unghi derivat din yaw)
  int16_t  distance_mm;           //  2
  float    pitch, roll, yaw;      // 12  [rad]
  float    ax, ay, az;            // 12  [m/s^2]
  float    gx, gy, gz;            // 12  [rad/s]
  float    temp_c;                //  4  [°C]
  uint8_t  swing;                 //  1  fază de balans detectată (0/1)
  uint8_t  servo;                 //  1  unghi servo curent [0..180]
  uint8_t  vibration;             //  1  nivel PWM vibrații curent [0..255]
};
#pragma pack(pop)
static_assert(sizeof(TelemetryPacket) == 50, "TelemetryPacket trebuie sa aiba 50 de octeti");

// Comandă actuator (BLE -> core 1). Tip + doi parametri generici.
enum ActCmdType : uint8_t { ACT_ROTATE_REL = 0, ACT_SERVO_POSE = 1, ACT_VIBRATE = 2 };
struct ActuatorCommand {
  ActCmdType type;
  int16_t    a;   // ROTATE: grade;  POSE: poză(0/1/2);  VIBRATE: intensitate
  int16_t    b;   // POSE: mod(0=gait,1=imediat);  VIBRATE: durată ms
};

// Zone de distanță pentru ritmul cardiac haptic (declarat aici ca tipul să fie
// cunoscut de prototipurile auto-generate ale funcțiilor heartbeat).
enum HbZone : uint8_t { ZONE_NONE = 0, ZONE_SLOW, ZONE_MEDIUM, ZONE_FAST };

// ---------------- Stare partajată ----------------
static portMUX_TYPE     g_snapMux = portMUX_INITIALIZER_UNLOCKED;
static TelemetryPacket  g_snapshot = {};        // scris de core 1, citit de stiva BLE
static QueueHandle_t    g_actQueue = nullptr;   // comenzi actuator, BLE -> core 1

// Stare senzori: false = absent/mut (la init sau la runtime). Disciplina de acces
// pe magistralele I2C (fără lock): core 1 atinge senzorul DOAR cât flag-ul lui e
// true; task-ul de întreținere (maintTask, core 0) îl atinge DOAR cât e false și
// ridică flag-ul ULTIMUL, după reconfigurarea completă — de aici volatile.
static volatile bool g_mpuOk = false;
static volatile bool g_tofOk = false;
// Ultimul moment în care ToF a semnalat dataReady() ("viu" pe I2C); folosit la
// detecția senzorului mut. Scriere de 32 de biți aliniată => atomică pe Xtensa.
static volatile unsigned long g_lastTofEventMs = 0;

// ---------------- Stare BLE ----------------
// Securitatea (pairing cu PIN + criptare) este IMPUSĂ de permisiunile GATT ENC_MITM
// pe caracteristici: fără pairing reușit, stiva respinge scrierile pe RX și abonarea
// la notificările TX. Aici urmărim doar starea conexiunii pentru gating-ul emisiei.
static BLECharacteristic* g_txChar    = nullptr;   // NOTIFY: ESP -> Central
static BLE2902*           g_cccd      = nullptr;    // descriptorul CCCD al TX (stare abonare)
static SemaphoreHandle_t  g_bleTxMux  = nullptr;    // serializează notificările
static volatile bool      g_connected = false;      // sesiune BLE activă
static volatile bool      g_subscribed = false;     // clientul s-a abonat la TX (cere link criptat)

// ---------------- Parser cadru (automat finit) — IDENTIC cu varianta TCP ----------------
class FrameParser {
public:
  uint8_t  opcode = 0;
  uint16_t length = 0;
  uint8_t  payload[P_MAX_PAYLOAD];
  uint8_t  raw[4 + P_MAX_PAYLOAD + 1];   // cadrul brut (STX..ETX) pentru dump hexa
  uint16_t rawLen = 0;

  void reset() { state_ = S_STX; }

  // Returnează true când un cadru complet și valid a fost recepționat.
  bool feed(uint8_t b) {
    const uint32_t now = millis();
    if (state_ != S_STX && (now - lastByteMs_) > P_INTERBYTE_TIMEOUT_MS) {
      state_ = S_STX;               // resincronizare pe timeout inter-octet
    }
    lastByteMs_ = now;

    if (state_ == S_STX) {
      if (b == P_STX) { rawLen = 0; raw[rawLen++] = b; }
    } else if (rawLen < sizeof(raw)) {
      raw[rawLen++] = b;
    }

    switch (state_) {
      case S_STX:
        if (b == P_STX) state_ = S_OPCODE;
        break;
      case S_OPCODE:
        opcode = b;
        state_ = S_LEN_L;
        break;
      case S_LEN_L:
        length = b;
        state_ = S_LEN_H;
        break;
      case S_LEN_H:
        length |= static_cast<uint16_t>(b) << 8;
        if (length > P_MAX_PAYLOAD) { state_ = S_STX; break; }
        idx_   = 0;
        state_ = (length > 0) ? S_PAYLOAD : S_ETX;
        break;
      case S_PAYLOAD:
        payload[idx_++] = b;
        if (idx_ >= length) state_ = S_ETX;
        break;
      case S_ETX:
        state_ = S_STX;
        return (b == P_ETX);        // ETX invalid => cadru respins, resincronizare
    }
    return false;
  }

private:
  enum State : uint8_t { S_STX, S_OPCODE, S_LEN_L, S_LEN_H, S_PAYLOAD, S_ETX };
  State    state_      = S_STX;
  uint16_t idx_        = 0;
  uint32_t lastByteMs_ = 0;
};

// ---------------- Logging (configurabil la compilare, vezi LOG_ENABLED) ----------------
// ATENȚIE (gotcha .ino): blocul stă DUPĂ clasa FrameParser — logRealtime/logTask
// sunt primele funcții din sketch, iar prototipurile auto-generate de Arduino se
// inserează chiar înaintea lor; orice tip folosit în semnături trebuie să fie
// deja declarat mai sus.
#if LOG_ENABLED
#define LOG_MSG_MAX   240   // o linie [TELE] completă încape
#define LOG_QUEUE_LEN 16

