yokosumei/Keryke-OS/kerike_concurs/firmware/esp32_keryke_ble/esp32_keryke_ble.ino
struct LogMsg { char text[LOG_MSG_MAX]; };
static QueueHandle_t g_logQueue = nullptr;

// Emitere din contextul de timp real (core 1): formatare + coadă, fără UART.
// Coadă plină => mesajul se PIERDE (preferăm pierderea unui log în locul
// blocării buclei de timp real pe UART).
static void logRealtime(const char* fmt, ...) {
  if (!g_logQueue) return;
  LogMsg m;
  va_list args;
  va_start(args, fmt);
  vsnprintf(m.text, sizeof(m.text), fmt, args);
  va_end(args);
  xQueueSend(g_logQueue, &m, 0);
}

// Task pe core 0: golește coada și scrie pe UART (aici blocarea e inofensivă).
static void logTask(void*) {
  LogMsg m;
  for (;;) {
    if (xQueueReceive(g_logQueue, &m, portMAX_DELAY) == pdTRUE) Serial.print(m.text);
  }
}

#define LOG_RT(...)     logRealtime(__VA_ARGS__)     // din core 1 (loop / acqTask)
#define LOG_DIRECT(...) Serial.printf(__VA_ARGS__)   // din setup() sau core 0
#else
#define LOG_RT(...)     do {} while (0)
#define LOG_DIRECT(...) do {} while (0)
#endif

// ---------------- Depanare: dump hexazecimal cadre (doar cu LOG_HEXDUMP) ----------------
// Apelat exclusiv din contexte de pe core 0 (callback BLE / task push).
static void hexDumpFrame(const char* dir, const uint8_t* data, uint16_t len) {
#if LOG_ENABLED && LOG_HEXDUMP
  Serial.printf("%s cadru [%u octeti]:", dir, len);
  for (uint16_t i = 0; i < len; ++i) Serial.printf(" %02X", data[i]);
  Serial.println();
#else
  (void)dir; (void)data; (void)len;
#endif
}

// ---------------- Serializare / transmisie prin NOTIFY ----------------
// Trimite un cadru complet (STX..ETX) ca o singură notificare BLE. Fără sesiune
// activă (sau link necriptat) => nu trimite nimic. MTU 517 => cadrul (max 55 la
// telemetrie) încape într-o singură notificare.
static bool bleSendFrame(uint8_t opcode, const uint8_t* payload, uint16_t len) {
  if (!g_connected || !g_txChar || len > P_MAX_PAYLOAD) return false;
  uint8_t buf[1 + 1 + 2 + P_MAX_PAYLOAD + 1];
  uint16_t i = 0;
  buf[i++] = P_STX;
  buf[i++] = opcode;
  buf[i++] = static_cast<uint8_t>(len & 0xFF);
  buf[i++] = static_cast<uint8_t>(len >> 8);
  if (len) { memcpy(&buf[i], payload, len); i += len; }
  buf[i++] = P_ETX;

  if (g_bleTxMux) xSemaphoreTake(g_bleTxMux, portMAX_DELAY);
  g_txChar->setValue(buf, i);
  g_txChar->notify();
  if (g_bleTxMux) xSemaphoreGive(g_bleTxMux);

  hexDumpFrame("[TX]", buf, i);
  return true;
}

static void sendAck(uint8_t echoedOpcode, int16_t value) {
  uint8_t p[3] = { echoedOpcode,
                   static_cast<uint8_t>(value & 0xFF),
                   static_cast<uint8_t>((value >> 8) & 0xFF) };
  bleSendFrame(RSP_ACK, p, sizeof(p));
}

static void sendNack(uint8_t echoedOpcode, uint8_t code) {
  uint8_t p[2] = { echoedOpcode, code };
  bleSendFrame(RSP_NACK, p, sizeof(p));
}

// Trimite un cadru de telemetrie cu instantaneul curent. Opcode-ul distinge sursa:
// RSP_TELEMETRY (răspuns solicitat) vs RSP_TELEMETRY_PUSH (push periodic).
static bool sendTelemetry(uint8_t opcode = RSP_TELEMETRY) {
  TelemetryPacket snap;
  taskENTER_CRITICAL(&g_snapMux);
  snap = g_snapshot;                         // copie atomică a instantaneului
  taskEXIT_CRITICAL(&g_snapMux);
  return bleSendFrame(opcode,
                      reinterpret_cast<const uint8_t*>(&snap), sizeof(snap));
}

// ---------------- Dispecer de comenzi ----------------
static void handleFrame(const FrameParser& f) {
  switch (f.opcode) {

    case CMD_GET_TELEMETRY: {
      if (f.length != 0) { sendNack(f.opcode, NACK_BAD_LENGTH); return; }
      sendTelemetry();
      break;
    }

    case CMD_MOTOR_ROTATE: {
      if (f.length != 2) { sendNack(f.opcode, NACK_BAD_LENGTH); return; }
      int16_t deg;
      memcpy(&deg, f.payload, sizeof(deg));    // int16 little-endian
      ActuatorCommand cmd{ ACT_ROTATE_REL, deg, 0 };
      if (xQueueSend(g_actQueue, &cmd, 0) == pdTRUE) sendAck(f.opcode, deg);
      else                                           sendNack(f.opcode, NACK_MOTOR_BUSY);
      break;
    }

    case CMD_SERVO_POSE: {
      if (f.length != 2) { sendNack(f.opcode, NACK_BAD_LENGTH); return; }
      const uint8_t pose = f.payload[0];       // 0=centru, 1=stânga, 2=dreapta
      const uint8_t mode = f.payload[1];       // 0=gait-sync, 1=imediat
      ActuatorCommand cmd{ ACT_SERVO_POSE, (int16_t)pose, (int16_t)mode };
      if (xQueueSend(g_actQueue, &cmd, 0) == pdTRUE) sendAck(f.opcode, pose);
      else                                           sendNack(f.opcode, NACK_MOTOR_BUSY);
      break;
    }

    case CMD_VIBRATE: {
      if (f.length != 3) { sendNack(f.opcode, NACK_BAD_LENGTH); return; }
      const uint8_t intensity = f.payload[0];  // 0..255
      uint16_t durationMs;
      memcpy(&durationMs, &f.payload[1], sizeof(durationMs));  // uint16 little-endian
      ActuatorCommand cmd{ ACT_VIBRATE, (int16_t)intensity, (int16_t)durationMs };
      if (xQueueSend(g_actQueue, &cmd, 0) == pdTRUE) sendAck(f.opcode, intensity);
      else                                           sendNack(f.opcode, NACK_MOTOR_BUSY);
      break;
    }

    default:
      sendNack(f.opcode, NACK_UNKNOWN_OPCODE);
  }
}

// ---------------- Callback-uri BLE: server (conectare/deconectare) ----------------
// Semnături portabile (1-argument): librăria le apelează pe acestea (BLEServer.cpp
// invocă atât varianta 1-arg cât și cea Bluedroid), deci nu depindem de tipuri IDF.
class ServerCallbacks : public BLEServerCallbacks {
  void onConnect(BLEServer* srv) override {
    g_connected  = true;
    g_subscribed = false;             // se abonează la TX abia după pairing (PIN + criptare)
    LOG_DIRECT("[BLE] Conectat (conn_id=%u) — pairing cu PIN + criptare necesare "
               "inainte de orice schimb.\n", srv->getConnId());
    // NU reporni advertising: o singură sesiune activă (ca serverul TCP listen(1)).
  }

  void onDisconnect(BLEServer* srv) override {
    g_connected  = false;
    g_subscribed = false;
    LOG_DIRECT("[BLE] Deconectat — repornesc advertising.\n");
    srv->getAdvertising()->start();   // redevine descoperibil pentru reconectare
  }
};

// ---------------- Callback-uri BLE: RX (comenzi de la central) ----------------
// Permisiunea GATT ENC_MITM pe caracteristica RX garantează că onWrite se declanșează
// DOAR pe un link criptat + autentificat (pairing cu PIN reușit). Fără pairing, stiva
// respinge scrierea înainte de a ajunge aici — deci nu mai e nevoie de verificări.
class RxCallbacks : public BLECharacteristicCallbacks {
public:
  void onWrite(BLECharacteristic* chr) override {
    const uint8_t* data = chr->getData();
    const size_t   n    = chr->getLength();
    for (size_t i = 0; i < n; ++i) {
      if (parser_.feed(data[i])) {
        hexDumpFrame("[RX]", parser_.raw, parser_.rawLen);
        handleFrame(parser_);
      }
    }
  }
private:
  FrameParser parser_;
};

// ---------------- Task push telemetrie (nesolicitat, 5 s) ----------------
// Emisia se face doar când clientul e abonat la notificări (CCCD are permisiune
// ENC_MITM => abonarea implică pairing reușit). Astfel push-ul confirmă și securizarea.
static void blePushTask(void*) {
  uint32_t seq = 0;
  bool mtuWarned = false;
  for (;;) {
    vTaskDelay(pdMS_TO_TICKS(P_TELEMETRY_PUSH_MS));
    // Valoarea CCCD persistă în stiva locală și după deconectare — abonarea e
    // relevantă doar pe o conexiune activă (altfel logul ar arăta fals "abonat=DA").
    g_subscribed = (g_connected && g_cccd && g_cccd->getNotifications());

    // Gardă MTU: notify() TRUNCHIAZĂ tăcut la MTU-3 al peer-ului (BLECharacteristic.cpp).
    // Cadrul de telemetrie are 55 octeți => centralul trebuie să fi negociat MTU >= 58,
    // altfel TOATE cadrele ar sosi ciuntite. Semnalăm explicit ca defectul să fie vizibil.
    if (g_connected) {
      BLEServer* srv = BLEDevice::getServer();
      const uint16_t peerMtu = srv ? srv->getPeerMTU(srv->getConnId()) : 0;
      if (peerMtu > 0 && peerMtu < 58 && !mtuWarned) {
        mtuWarned = true;
        LOG_DIRECT("[BLE] AVERTISMENT: MTU negociat=%u (<58) — notificarile de "
                   "telemetrie vor fi TRUNCHIATE. Clientul trebuie sa ceara MTU mai mare "
                   "(bleak/BlueZ si Windows o fac implicit).\n", peerMtu);
      }
    } else {
      mtuWarned = false;                        // re-verifică la următoarea conexiune
    }
    const bool ok = (g_connected && g_subscribed);
    const char* emitStare = !ok ? "OMIS (fara abonare securizata)"
                                : (sendTelemetry(RSP_TELEMETRY_PUSH) ? "OK (55 octeti)"
                                                                     : "ESUAT (notify)");
    LOG_DIRECT("[TELE] tentativa #%lu | BLE=%s | abonat(securizat)=%s | emisie=%s\n",
               (unsigned long)seq,
               g_connected ? "CONECTAT" : "DECONECTAT",
               g_subscribed ? "DA" : "NU", emitStare);
    seq++;
  }
}

// ---------------- Inițializare BLE securizat ----------------
static void setupBLE() {
  g_bleTxMux = xSemaphoreCreateMutex();

  LOG_DIRECT("[BOOT] pornesc stiva BLE (BLEDevice::init)...\n");
  BLEDevice::init(BLE_DEVICE_NAME);
  BLEDevice::setMTU(517);            // cadrul de telemetrie (55B) încape într-o notificare

  // --- Parametri de securitate: LE Secure Connections + MITM + Bonding, passkey static ---
  // IO capability „DisplayOnly": ESP-ul „afișează" (fix), centralul INTRODUCE PIN-ul.
  // Passkey-ul static + IO DisplayOnly + MITM sunt suficiente ca stiva să ceară PIN-ul;
  // enforcement-ul efectiv vine din permisiunile ENC_MITM ale caracteristicilor.
  BLESecurity* sec = new BLESecurity();
  sec->setAuthenticationMode(ESP_LE_AUTH_REQ_SC_MITM_BOND);  // Secure Connections + MITM + Bond
  sec->setCapability(ESP_IO_CAP_OUT);                        // DisplayOnly => centralul tastează PIN-ul
  sec->setKeySize(16);
  sec->setInitEncryptionKey(ESP_BLE_ENC_KEY_MASK | ESP_BLE_ID_KEY_MASK);
  sec->setRespEncryptionKey(ESP_BLE_ENC_KEY_MASK | ESP_BLE_ID_KEY_MASK);
  sec->setPassKey(true, BLE_PASSKEY);                        // passkey STATIC (parola fixă)

  // --- Server + serviciu GATT ---
  BLEServer* server = BLEDevice::createServer();
  server->setCallbacks(new ServerCallbacks());

  BLEService* service = server->createService(KERYKE_SERVICE_UUID);

