yokosumei/Keryke-OS/kerike_concurs/firmware/esp32_keryke_ble/esp32_keryke_ble.ino
  // TX (NOTIFY): ESP -> Central. Acces doar pe link criptat+autentificat.
  g_txChar = service->createCharacteristic(
      KERYKE_TX_UUID,
      BLECharacteristic::PROPERTY_NOTIFY | BLECharacteristic::PROPERTY_READ);
  g_txChar->setAccessPermissions(ESP_GATT_PERM_READ_ENC_MITM);
  g_cccd = new BLE2902();            // CCCD: abonarea cere link criptat (semnal de securizare)
  g_cccd->setAccessPermissions(ESP_GATT_PERM_READ_ENC_MITM | ESP_GATT_PERM_WRITE_ENC_MITM);
  g_txChar->addDescriptor(g_cccd);

  // RX (WRITE): Central -> ESP. Scrierea cere link criptat+autentificat (forțează pairing).
  BLECharacteristic* rxChar = service->createCharacteristic(
      KERYKE_RX_UUID,
      BLECharacteristic::PROPERTY_WRITE | BLECharacteristic::PROPERTY_WRITE_NR);
  rxChar->setAccessPermissions(ESP_GATT_PERM_WRITE_ENC_MITM);
  rxChar->setCallbacks(new RxCallbacks());

  service->start();

  // --- Advertising ---
  BLEAdvertising* adv = BLEDevice::getAdvertising();
  adv->addServiceUUID(KERYKE_SERVICE_UUID);
  adv->setScanResponse(true);
  adv->setMinPreferred(0x06);       // intervale prietenoase cu iOS
  adv->setMinPreferred(0x12);

  BLEDevice::startAdvertising();
  LOG_DIRECT("[BLE] Advertising ca \"%s\". Passkey de imperechere: %06u\n",
             BLE_DEVICE_NAME, BLE_PASSKEY);
  LOG_DIRECT("[BLE] Conexiunea cere pairing cu PIN (MITM) + criptare inainte de "
             "orice schimb de date. Dispozitivele imperecheate raman bonded.\n");
}

// ==================================================================================
// De aici în jos: achiziție / actuatori / algoritmi — IDENTIC cu varianta TCP.
// ==================================================================================

// ---------------- Actuator (rulează pe core 1) ----------------
static int currentServoAngle = SERVO_CENTER;

// --- stare servo (poze gait-sync) ---
static int  targetServoAngle    = SERVO_CENTER;
static bool servoActionPending  = false;
static unsigned long servoReturnTime = 0;
static bool inSwingPhase        = false;

// --- stare motor vibrații ---
static int vibrationTarget      = 0;
static int vibrationCurrent     = 0;
static unsigned long vibrationEndTime    = 0;
static unsigned long lastVibrationUpdate = 0;

// --- stare detecție gait (fereastră glisantă) ---
static float accelMagHistory[GAIT_WINDOW_SIZE];
static float gyroZHistory[GAIT_WINDOW_SIZE];
static int  gaitHistoryIdx      = 0;
static bool gaitHistoryFilled   = false;
static unsigned long lastSwingDetected = 0;

static void servoWriteAngle(int angle) {
  angle = constrain(angle, 0, 180);
  const uint32_t us = SERVO_US_MIN +
      (uint32_t)((SERVO_US_MAX - SERVO_US_MIN) * (angle / 180.0f));
  const uint32_t duty =
      (uint32_t)(((uint64_t)us << SERVO_RES_BITS) * SERVO_FREQ_HZ / 1000000ULL);
#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
  ledcWrite(SERVO_PIN, duty);        // 3.x: identificat prin pin
#else
  ledcWrite(SERVO_LEDC_CH, duty);    // 2.x: identificat prin canal
#endif
}

static int poseToAngle(uint8_t pose) {
  switch (pose) {
    case 1:  return SERVO_LEFT;
    case 2:  return SERVO_RIGHT;
    default: return SERVO_CENTER;
  }
}

static void moveServoTo(int angle, bool holdThenReturn) {
  currentServoAngle = constrain(angle, 0, 180);
  servoWriteAngle(currentServoAngle);
  servoReturnTime = holdThenReturn ? (millis() + SERVO_HOLD_MS) : 0;
}

static void commandServoPose(uint8_t pose, bool immediate) {
  targetServoAngle = poseToAngle(pose);
  if (immediate) {
    servoActionPending = false;
    moveServoTo(targetServoAngle, false);
    LOG_RT("[SERVO] pozitie imediata %d°\n", targetServoAngle);
  } else {
    servoActionPending = true;
    LOG_RT("[GAIT-SYNC] poza %d° programata (asteapta swing)\n", targetServoAngle);
  }
}

static void applyServoCommand() {
  if (!servoActionPending) {
    if (servoReturnTime && millis() > servoReturnTime && currentServoAngle != SERVO_CENTER) {
      moveServoTo(SERVO_CENTER, false);
      LOG_RT("[GAIT-SYNC] Servo revenit la centru\n");
    }
    return;
  }
  // Fără IMU nu există detecție de balans: degradare grațioasă — aplicare imediată,
  // altfel poza programată ar rămâne agățată la nesfârșit.
  if (inSwingPhase || !g_mpuOk) {
    moveServoTo(targetServoAngle, true);
    servoActionPending = false;
    LOG_RT("[GAIT-SYNC] Servo aplicat %s: %d°\n",
           g_mpuOk ? "in swing" : "imediat (IMU absent)", targetServoAngle);
  }
}

static void applyMotorRotation(int16_t deg) {
  moveServoTo(currentServoAngle + deg, false);
  LOG_RT("[MOTOR] Rotatie %+d° -> pozitie %d°\n", deg, currentServoAngle);
}

// --- Motor vibrații: scriere PWM + impuls cu durată + rampă lină ---
static void vibrationWrite(int level) {
  level = constrain(level, 0, 255);
  vibrationCurrent = level;
#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
  ledcWrite(VIBRATION_PIN, level);
#else
  ledcWrite(VIBRATION_LEDC_CH, level);
#endif
}

static void triggerVibration(int intensity, int durationMs) {
  vibrationTarget  = constrain(intensity, 0, 255);
  vibrationEndTime = millis() + durationMs;
}

static void updateVibration() {
  const unsigned long now = millis();
  if (now - lastVibrationUpdate < 4) return;
  lastVibrationUpdate = now;

  if (vibrationEndTime && now > vibrationEndTime) vibrationTarget = 0;

  if (vibrationCurrent < vibrationTarget)
    vibrationCurrent = min(vibrationCurrent + VIBRATION_RAMP_STEP, vibrationTarget);
  else if (vibrationCurrent > vibrationTarget)
    vibrationCurrent = max(vibrationCurrent - VIBRATION_RAMP_STEP, vibrationTarget);
  vibrationWrite(vibrationCurrent);
}

// --- Ritm cardiac haptic la obstacol (mașină de stări non-blocantă "lub-dub") ---
static HbZone        hbZone       = ZONE_NONE;
static uint8_t       hbPhase      = 0;
static unsigned long hbPhaseStart = 0;
static uint32_t      hbPeriodMs   = 0;

static HbZone heartbeatZone(int16_t dist) {
  if (dist <= 0)                return ZONE_NONE;
  if (dist < HB_DIST_FAST_MM)   return ZONE_FAST;
  if (dist < HB_DIST_MEDIUM_MM) return ZONE_MEDIUM;
  if (dist < HB_DIST_SLOW_MM)   return ZONE_SLOW;
  return ZONE_NONE;
}

static uint32_t heartbeatPeriod(HbZone z) {
  switch (z) {
    case ZONE_FAST:   return HB_PERIOD_FAST_MS;
    case ZONE_MEDIUM: return HB_PERIOD_MEDIUM_MS;
    case ZONE_SLOW:   return HB_PERIOD_SLOW_MS;
    default:          return 0;
  }
}

