yokosumei/Keryke-OS/kerike_concurs/firmware/esp32_keryke_ble/esp32_keryke_ble.ino
static void updateHeartbeat(uint32_t periodMs, unsigned long now) {
  if (periodMs == 0) {
    if (hbPeriodMs != 0) { vibrationWrite(0); hbPeriodMs = 0; }
    return;
  }
  if (hbPeriodMs == 0) { hbPhase = 0; hbPhaseStart = now; }
  hbPeriodMs = periodMs;

  const unsigned long elapsed = now - hbPhaseStart;
  switch (hbPhase) {
    case 0:  vibrationWrite(HB_LUB_LEVEL); if (elapsed >= HB_LUB_MS) { hbPhase = 1; hbPhaseStart = now; } break;
    case 1:  vibrationWrite(0);            if (elapsed >= HB_GAP_MS) { hbPhase = 2; hbPhaseStart = now; } break;
    case 2:  vibrationWrite(HB_DUB_LEVEL); if (elapsed >= HB_DUB_MS) { hbPhase = 3; hbPhaseStart = now; } break;
    default: {
      vibrationWrite(0);
      const unsigned long beatSpan = HB_LUB_MS + HB_GAP_MS + HB_DUB_MS;
      const unsigned long restMs   = (periodMs > beatSpan) ? (periodMs - beatSpan) : 0;
      if (elapsed >= restMs) { hbPhase = 0; hbPhaseStart = now; }
      break;
    }
  }
}

// --- Detecție fază de balans (gait) din IMU ---
static bool detectSwingPhase(float accelMag, float gyroZ) {
  accelMagHistory[gaitHistoryIdx] = accelMag;
  gyroZHistory[gaitHistoryIdx]    = gyroZ;
  gaitHistoryIdx = (gaitHistoryIdx + 1) % GAIT_WINDOW_SIZE;
  if (gaitHistoryIdx == 0) gaitHistoryFilled = true;
  if (!gaitHistoryFilled) return false;

  float sum = 0;
  for (int i = 0; i < GAIT_WINDOW_SIZE; i++) sum += accelMagHistory[i];
  const float mean = sum / GAIT_WINDOW_SIZE;

  const bool accelDip = (accelMag < mean - GAIT_ACCEL_DIP);
  const bool gyroPeak = (fabsf(gyroZ) > GAIT_GYRO_PEAK);
  if (accelDip && gyroPeak) {
    const unsigned long now = millis();
    if (now - lastSwingDetected > MIN_SWING_INTERVAL_MS) {
      lastSwingDetected = now;
      return true;
    }
  }
  return false;
}

// ---------------- LED de stare (semnalizare non-blocantă a senzorilor) ----------------
static unsigned long ledLastToggle = 0;
static bool          ledPhaseOn    = false;
static bool          ledAltColor   = false;  // alternare roșu/galben când ambii senzori au picat

static void statusLedWrite(uint8_t r, uint8_t g, uint8_t b) {
#ifdef RGB_BUILTIN
  // WS2812 integrat: scalare cu luminozitatea configurată
  rgbLedWrite(STATUS_LED_PIN,
              (uint16_t)r * STATUS_LED_BRIGHTNESS / 255,
              (uint16_t)g * STATUS_LED_BRIGHTNESS / 255,
              (uint16_t)b * STATUS_LED_BRIGHTNESS / 255);
#else
  digitalWrite(STATUS_LED_PIN, (r || g || b) ? HIGH : LOW);
#endif
}

static void statusLedInit() {
#ifndef RGB_BUILTIN
  pinMode(STATUS_LED_PIN, OUTPUT);
#endif
  statusLedWrite(0, 0, 0);
}

// Mașină de stări pe millis() (același stil ca updateHeartbeat) — apelată la FIECARE
// iterație loop(). Coduri: verde puls scurt/3s = ambii OK; roșu clipind = ToF picat
// (critic pt. siguranță); galben clipind = IMU picat; roșu/galben alternat = ambii.
static void updateStatusLed(unsigned long now) {
  if (g_mpuOk && g_tofOk) {
    if (!ledPhaseOn) {
      if (now - ledLastToggle >= 3000) {
        statusLedWrite(0, 255, 0);
        ledPhaseOn = true;
        ledLastToggle = now;
      }
    } else if (now - ledLastToggle >= 50) {
      statusLedWrite(0, 0, 0);
      ledPhaseOn = false;
      ledLastToggle = now;
    }
    return;
  }
  if (now - ledLastToggle < 300) return;
  ledLastToggle = now;
  ledPhaseOn = !ledPhaseOn;
  if (!ledPhaseOn) {
    statusLedWrite(0, 0, 0);
  } else if (!g_tofOk && !g_mpuOk) {
    ledAltColor = !ledAltColor;
    if (ledAltColor) statusLedWrite(255, 0, 0);
    else             statusLedWrite(255, 160, 0);
  } else if (!g_tofOk) {
    statusLedWrite(255, 0, 0);          // roșu: ToF indisponibil
  } else {
    statusLedWrite(255, 160, 0);        // galben: IMU indisponibil
  }
}

// Semnal haptic de diagnostic la boot (utilizatorul final e nevăzător, nu vede LED-ul):
// 3 pulsuri lungi = ToF picat; 2 pulsuri lungi = IMU picat (grupuri separate de pauză).
// Blocant, dar scurt și executat O SINGURĂ DATĂ, înainte de pornirea achiziției.
static void signalSensorFaultHaptic() {
  if (g_tofOk && g_mpuOk) return;
  delay(600);                            // separare de self-test-ul de vibrații
  if (!g_tofOk) {
    for (int i = 0; i < 3; i++) { vibrationWrite(255); delay(400); vibrationWrite(0); delay(250); }
  }
  if (!g_mpuOk) {
    delay(600);                          // pauză între grupuri
    for (int i = 0; i < 2; i++) { vibrationWrite(255); delay(400); vibrationWrite(0); delay(250); }
  }
  vibrationWrite(0);
  vibrationCurrent = 0;
  vibrationTarget  = 0;
}

// ---------------- Self-test de pornire ----------------
static bool selfTestMPU() {
  sensors_event_t a, g, t;
  if (!mpu.getEvent(&a, &g, &t)) {
    LOG_DIRECT("[SELFTEST] MPU6050: citire esuata\n");
    return false;
  }
  const float amag = sqrtf(a.acceleration.x * a.acceleration.x +
                           a.acceleration.y * a.acceleration.y +
                           a.acceleration.z * a.acceleration.z);
  LOG_DIRECT("[SELFTEST] MPU6050: |a|=%.2f m/s^2  T=%.1f°C  gyro=(%.2f,%.2f,%.2f) rad/s\n",
             amag, t.temperature, g.gyro.x, g.gyro.y, g.gyro.z);
  return (amag > 6.0f && amag < 14.0f);
}

static bool selfTestToF() {
  const uint32_t t0 = millis();
  while (!vl53.dataReady() && (millis() - t0) < 500) delay(10);
  if (!vl53.dataReady()) {
    LOG_DIRECT("[SELFTEST] VL53L1X: fara masuratoare (timeout)\n");
    return false;
  }
  const int16_t d = vl53.distance();
  vl53.clearInterrupt();
  LOG_DIRECT("[SELFTEST] VL53L1X: distanta=%d mm\n", d);
  return (d >= 0);
}

static void selfTestServoSweep() {
  LOG_DIRECT("[SELFTEST] Servo SG90: check miscare 90->45->135->90 ...\n");
  const int seq[] = { SERVO_CENTER, SERVO_LEFT, SERVO_RIGHT, SERVO_CENTER };
  for (unsigned i = 0; i < sizeof(seq) / sizeof(seq[0]); ++i) {
    servoWriteAngle(seq[i]);
    delay(450);
  }
  currentServoAngle = SERVO_CENTER;
}

static void selfTestVibration() {
  LOG_DIRECT("[SELFTEST] Motor vibratii (GPIO%d): PLIN 255 pentru 1.5s ...\n", VIBRATION_PIN);
  vibrationWrite(255);
  delay(1500);
  LOG_DIRECT("[SELFTEST] Motor vibratii: 3 pulsuri ...\n");
  for (int i = 0; i < 3; i++) {
    vibrationWrite(255); delay(200);
    vibrationWrite(0);   delay(200);
  }
  vibrationWrite(0);
  vibrationCurrent = 0;
  vibrationTarget  = 0;
}

