yokosumei/Keryke-OS/kerike_concurs/firmware/esp32_keryke_ble/esp32_keryke_ble.ino
static void runStartupSelfTest() {
  LOG_DIRECT("\n[SELFTEST] ===== Verificare de pornire =====\n");
  LOG_DIRECT("[SELFTEST] Senzor MPU6050 : %s\n",
             g_mpuOk ? (selfTestMPU() ? "OK" : "ESUAT") : "SARIT (absent la init)");
  LOG_DIRECT("[SELFTEST] Senzor VL53L1X : %s\n",
             g_tofOk ? (selfTestToF() ? "OK" : "ESUAT") : "SARIT (absent la init)");
  selfTestServoSweep();
  selfTestVibration();
  LOG_DIRECT("[SELFTEST] ===== Gata =====\n\n");
}

// ---------------- Achiziție ----------------
static unsigned long counter        = 0;
static int16_t       lastDistance   = 0;
static bool          distanceValid  = false;
static unsigned long lastValidTofMs = 0;
static int           simAngle       = 90;
static float         yawIntegrated  = 0.0f;
static unsigned long lastYawUpdate  = 0;
static const unsigned long SAMPLE_INTERVAL_MS = 50;   // perioada acqTask (vTaskDelayUntil)

// --- Filtru median glisant pentru distanța ToF ---
static int16_t tofBuf[TOF_MEDIAN_N];
static uint8_t tofBufIdx   = 0;
static uint8_t tofBufCount = 0;
static int16_t  tofLastRaw    = 0;
static uint8_t  tofLastStatus = 255;
static uint16_t tofLastSignal = 0;
static unsigned long lastTofPollMs = 0;   // limitator interogare dataReady() (TOF_POLL_MS)

static void tofPush(int16_t d) {
  tofBuf[tofBufIdx] = d;
  tofBufIdx = (tofBufIdx + 1) % TOF_MEDIAN_N;
  if (tofBufCount < TOF_MEDIAN_N) tofBufCount++;
}

static int16_t tofMedian() {
  int16_t t[TOF_MEDIAN_N];
  const uint8_t n = tofBufCount;
  for (uint8_t i = 0; i < n; i++) t[i] = tofBuf[i];
  for (uint8_t i = 1; i < n; i++) {
    const int16_t key = t[i];
    int j = i - 1;
    while (j >= 0 && t[j] > key) { t[j + 1] = t[j]; j--; }
    t[j + 1] = key;
  }
  return (n > 0) ? t[n / 2] : 0;
}

// Inițializare + configurare + pornire ranging VL53L1X — comună pentru setup()
// și tofRecover(). Actualizează g_tofOk prin valoarea de retur.
static bool tofConfigureAndStart() {
  if (!vl53.begin(0x29, &I2CTOF)) return false;
  vl53.VL53L1X_SetDistanceMode(TOF_DISTANCE_MODE);
  vl53.setTimingBudget(TOF_TIMING_BUDGET_MS);
  vl53.VL53L1X_SetInterMeasurementInMs(TOF_INTERMEAS_MS);
  return vl53.startRanging();
}

// Rulează în setup() (core 1, înainte de pornirea achiziției) și apoi EXCLUSIV
// în maintTask (core 0). Flag-ul g_tofOk se publică ULTIMUL, după reconfigurarea
// completă — cât e false, core 1 nu atinge magistrala ToF.
static void tofRecover() {
  LOG_DIRECT("[TOF] senzor absent/mut pe I2C -> reinitializare...\n");
  vl53.VL53L1X_StopRanging();
  const bool ok = tofConfigureAndStart();
  if (ok) {
    tofBufCount      = 0;
    g_lastTofEventMs = millis();
    LOG_DIRECT("[TOF] reinitializat OK\n");
  } else {
    LOG_DIRECT("[TOF] reinit ESUAT (vl_status=%d) -> verifica cablajul/alimentarea VL53L1X!\n",
               vl53.vl_status);
  }
  g_tofOk = ok;
}

// Configurare MPU6050 — comună pentru setup() și mpuRecover().
static void mpuConfigure() {
  mpu.setAccelerometerRange(MPU6050_RANGE_8_G);
  mpu.setGyroRange(MPU6050_RANGE_500_DEG);
  mpu.setFilterBandwidth(MPU6050_BAND_21_HZ);
}

// Rulează exclusiv în maintTask (core 0); flag-ul se ridică după configurare.
static void mpuRecover() {
  LOG_DIRECT("[MPU] senzor absent/mut -> reinitializare...\n");
  if (mpu.begin(0x68, &I2CMPU)) {
    mpuConfigure();
    g_mpuOk = true;
    LOG_DIRECT("[MPU] reinitializat OK\n");
  } else {
    LOG_DIRECT("[MPU] reinit ESUAT -> verifica cablajul/alimentarea MPU6050!\n");
  }
}

// ---------------- Task întreținere senzori (core 0) ----------------
// begin()-urile Adafruit conțin delay-uri interne (~100 ms la MPU6050, zeci de ms
// la VL53L1X prin XSHUT). Rulate pe core 0, aceste blocări NU mai produc sughițuri
// în bucla de timp real (ritm haptic/servo) tocmai când un senzor e picat.
static void maintTask(void*) {
  unsigned long lastTofTry = 0, lastMpuTry = 0;
  for (;;) {
    vTaskDelay(pdMS_TO_TICKS(250));
    const unsigned long now = millis();
    if (!g_tofOk && (now - lastTofTry) >= TOF_RECOVER_MS) { lastTofTry = now; tofRecover(); }
    if (!g_mpuOk && (now - lastMpuTry) >= MPU_RECOVER_MS) { lastMpuTry = now; mpuRecover(); }
  }
}

static void updateSimAngle() {
  const float yawDeg = yawIntegrated * 180.0f / M_PI;
  simAngle = constrain(90 + (int)yawDeg, 0, 180);
}

// ---------------- Task achiziție IMU + publicare telemetrie (core 1) ----------------
// vTaskDelayUntil => perioadă STRICT fixă de SAMPLE_INTERVAL_MS (fără drift), la
// prioritate peste loopTask => eșantioane echidistante pentru fereastra gait,
// indiferent de durata iterațiilor din loop(). Rulează pe ACELAȘI core cu loop()
// (disciplina „core 1 = achiziție + control" rămâne intactă); starea partajată cu
// loop() e formată doar din scalari aliniați (bool/int16/int) => acces atomic.
static void acqTask(void*) {
  TickType_t lastWake = xTaskGetTickCount();
  for (;;) {
    vTaskDelayUntil(&lastWake, pdMS_TO_TICKS(SAMPLE_INTERVAL_MS));
    const unsigned long now = millis();

    // Fără IMU: telemetria continuă (counter/distanță/actuatori), câmpurile
    // inerțiale rămân 0, gait dezactivat (poza servo se aplică imediat).
    sensors_event_t a = {}, g = {}, temp = {};
    float pitch = 0.0f, roll = 0.0f;
    if (g_mpuOk && mpu.getEvent(&a, &g, &temp)) {
      pitch = atan2f(a.acceleration.x,
                     sqrtf(a.acceleration.y * a.acceleration.y +
                           a.acceleration.z * a.acceleration.z));
      roll  = atan2f(a.acceleration.y, a.acceleration.z);

      const float dt = (now - lastYawUpdate) / 1000.0f;
      yawIntegrated += g.gyro.z * dt;
      while (yawIntegrated >  M_PI) yawIntegrated -= 2 * M_PI;
      while (yawIntegrated < -M_PI) yawIntegrated += 2 * M_PI;

      updateSimAngle();

      const float accelMag = sqrtf(a.acceleration.x * a.acceleration.x +
                                   a.acceleration.y * a.acceleration.y +
                                   a.acceleration.z * a.acceleration.z);
      inSwingPhase = detectSwingPhase(accelMag, g.gyro.z);
    } else {
      if (g_mpuOk) {                     // citire eșuată pe un senzor considerat OK
        g_mpuOk = false;
        LOG_RT("[MPU] citire esuata -> senzor marcat absent (recuperare pe core 0)\n");
      }
      inSwingPhase = false;
    }
    // Actualizat în ambele ramuri: la revenirea IMU, dt nu acoperă golul de absență.
    lastYawUpdate = now;

    // Publicarea instantaneului (secțiune critică minimală: doar copiere)
    TelemetryPacket s;
    s.counter     = counter;
    s.angle       = static_cast<uint8_t>(simAngle);
    s.distance_mm = lastDistance;
    s.pitch = pitch;              s.roll = roll;   s.yaw = yawIntegrated;
    s.ax = a.acceleration.x;      s.ay = a.acceleration.y;  s.az = a.acceleration.z;
    s.gx = g.gyro.x;              s.gy = g.gyro.y;          s.gz = g.gyro.z;
    s.temp_c = temp.temperature;
    s.swing     = inSwingPhase ? 1 : 0;
    s.servo     = static_cast<uint8_t>(currentServoAngle);
    s.vibration = static_cast<uint8_t>(vibrationCurrent);

    taskENTER_CRITICAL(&g_snapMux);
    g_snapshot = s;
    taskEXIT_CRITICAL(&g_snapMux);

