yokosumei/Keryke-OS/kerike_concurs/firmware/esp32_keryke_ble/esp32_keryke_ble.ino
    if (counter % 40 == 0) {
      LOG_RT(
        "[TELE] #%lu angle=%d° dist=%dmm(%s) | pitch=%+.2f roll=%+.2f yaw=%+.2f rad | "
        "accel=(%+.2f,%+.2f,%+.2f)m/s2 gyro=(%+.2f,%+.2f,%+.2f)rad/s | T=%.1f°C | "
        "swing=%s servo=%d° vib=%d | tof[raw=%d st=%d sig=%u] ble=%s\n",
        counter, s.angle, s.distance_mm, distanceValid ? "ok" : "?",
        s.pitch, s.roll, s.yaw,
        s.ax, s.ay, s.az, s.gx, s.gy, s.gz,
        s.temp_c,
        s.swing ? "Y" : "N", s.servo, s.vibration,
        tofLastRaw, tofLastStatus, tofLastSignal,
        (g_connected && g_subscribed) ? "SECURIZAT" : (g_connected ? "CONECTAT" : "DECONECTAT"));
    }
    counter++;
  }
}

void setup() {
  Serial.begin(115200);
#if LOG_ENABLED
  // Coada + task-ul de logging (core 0) — primele, ca LOG_RT să fie funcțional
  // din momentul în care pornesc task-urile de timp real.
  g_logQueue = xQueueCreate(LOG_QUEUE_LEN, sizeof(LogMsg));
  xTaskCreatePinnedToCore(logTask, "log", 3072, nullptr, tskIDLE_PRIORITY + 1, nullptr, 0);
#endif
  // Marker IMEDIAT (inaintea delay-ului): daca acest mesaj nu apare pe monitor,
  // aplicatia nu porneste deloc (crash pre-app / setari gresite de placa).
  LOG_DIRECT("\n[BOOT] app pornit — setup() a inceput\n");
  statusLedInit();
  statusLedWrite(0, 0, 255);           // albastru continuu = setup() în curs
  delay(1000);
  LOG_DIRECT("[KERYKE v3 BLE] Initializare...\n");

  // Senzori — pornire NERESTRICȚIONATĂ: eșecul unui senzor NU blochează boot-ul,
  // ci este semnalizat (LED + haptic) și reîncercat periodic pe core 0 (maintTask).
  LOG_DIRECT("[BOOT] init I2C...\n");
  I2CMPU.begin(MPU_SDA, MPU_SCL);
  I2CTOF.begin(TOF_SDA, TOF_SCL);

  g_mpuOk = mpu.begin(0x68, &I2CMPU);
  if (g_mpuOk) {
    mpuConfigure();
    LOG_DIRECT("[KERYKE] MPU6050 OK\n");
  } else {
    LOG_DIRECT("[KERYKE] MPU6050 ABSENT -> pornesc degradat (fara IMU/gait); reincerc periodic\n");
  }

  g_tofOk = tofConfigureAndStart();
  g_lastTofEventMs = millis();
  if (g_tofOk) {
    LOG_DIRECT("[KERYKE] VL53L1X OK (mod %s, %dms, filtru median)\n",
               TOF_DISTANCE_MODE == 2 ? "LONG" : "SHORT", TOF_TIMING_BUDGET_MS);
  } else {
    LOG_DIRECT("[KERYKE] VL53L1X ABSENT/eroare (vl_status=%d) -> pornesc degradat "
               "(distanta NECUNOSCUTA, motor oprit); reincerc periodic\n", vl53.vl_status);
  }

  // Actuator — API LEDC diferit intre core 2.x si 3.x
#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
  const bool servoAttached = ledcAttach(SERVO_PIN, SERVO_FREQ_HZ, SERVO_RES_BITS);
  LOG_DIRECT("[SETUP] LEDC servo    (GPIO%d, %dHz/%d-bit): %s\n",
             SERVO_PIN, SERVO_FREQ_HZ, SERVO_RES_BITS,
             servoAttached ? "ATASAT OK" : "ESUAT !!!");
#else
  ledcSetup(SERVO_LEDC_CH, SERVO_FREQ_HZ, SERVO_RES_BITS);
  ledcAttachPin(SERVO_PIN, SERVO_LEDC_CH);
#endif
  servoWriteAngle(currentServoAngle);

#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
  const bool vibAttached = ledcAttach(VIBRATION_PIN, VIBRATION_FREQ_HZ, VIBRATION_RES_BITS);
  LOG_DIRECT("[SETUP] LEDC vibratii (GPIO%d, %dHz/%d-bit): %s\n",
             VIBRATION_PIN, VIBRATION_FREQ_HZ, VIBRATION_RES_BITS,
             vibAttached ? "ATASAT OK" : "ESUAT !!!");
#else
  ledcSetup(VIBRATION_LEDC_CH, VIBRATION_FREQ_HZ, VIBRATION_RES_BITS);
  ledcAttachPin(VIBRATION_PIN, VIBRATION_LEDC_CH);
#endif
  vibrationWrite(0);

  // Self-test de pornire (senzorii absenți sunt săriți) + diagnostic haptic:
  // utilizatorul nevăzător află de la boot dacă dispozitivul e degradat.
  runStartupSelfTest();
  signalSensorFaultHaptic();

  // Infrastructură concurentă
  g_actQueue = xQueueCreate(16, sizeof(ActuatorCommand));

  // Bluetooth securizat (advertising + pairing cu passkey)
  setupBLE();

  // Task de push telemetrie (nesolicitat, 5 s) pe core 0
  xTaskCreatePinnedToCore(blePushTask, "ble_push", 6144, nullptr,
                          tskIDLE_PRIORITY + 1, nullptr, 0);

  // Task de întreținere senzori (core 0): reinițializările cu delay-uri interne
  // nu mai ating bucla de timp real.
  xTaskCreatePinnedToCore(maintTask, "maint", 4096, nullptr,
                          tskIDLE_PRIORITY + 1, nullptr, 0);

  lastYawUpdate = millis();

  // Task de achiziție IMU + telemetrie (core 1), prioritate peste loopTask (=1):
  // vTaskDelayUntil îi dă cadență strict periodică de 50 ms.
  xTaskCreatePinnedToCore(acqTask, "acq", 6144, nullptr,
                          tskIDLE_PRIORITY + 2, nullptr, 1);

  LOG_DIRECT("[KERYKE v3 BLE] Achizitia porneste independent de starea Bluetooth "
             "si a senzorilor (stare senzori pe LED-ul integrat).\n\n");
}

void loop() {                                  // core 1: ToF + actuatori + LED
  const unsigned long now = millis();          // (eșantionarea IMU: acqTask, tot core 1)

  // 1) Comenzi actuator sosite din stiva BLE (dispecerizare pe tip)
  ActuatorCommand cmd;
  while (xQueueReceive(g_actQueue, &cmd, 0) == pdTRUE) {
    switch (cmd.type) {
      case ACT_ROTATE_REL: applyMotorRotation(cmd.a);                  break;
      case ACT_SERVO_POSE: commandServoPose((uint8_t)cmd.a, cmd.b != 0); break;
      case ACT_VIBRATE:    triggerVibration(cmd.a, cmd.b);             break;
    }
  }

  // 2) Distanță ToF: validare status + filtru median + fail-safe (prospețime).
  // Interogarea dataReady() e o tranzacție I2C reală (~0,5 ms) — limitată la
  // TOF_POLL_MS; măsurătoare nouă apare oricum doar la TOF_INTERMEAS_MS (55 ms).
  // Cu g_tofOk=false, core 1 nu atinge deloc magistrala (recuperarea rulează pe
  // core 0, în maintTask).
  if (g_tofOk && (now - lastTofPollMs) >= TOF_POLL_MS) {
    lastTofPollMs = now;
    if (vl53.dataReady()) {
      g_lastTofEventMs = now;                // senzorul e viu pe I2C
      uint8_t  st  = 255;
      uint16_t sig = 0;
      vl53.VL53L1X_GetRangeStatus(&st);
      const int16_t d = vl53.distance();
      vl53.VL53L1X_GetSignalPerSpad(&sig);
      vl53.clearInterrupt();
      tofLastRaw = d; tofLastStatus = st; tofLastSignal = sig;
      if (st == 0 && d > 0) {
        tofPush(d);
        lastDistance   = tofMedian();
        distanceValid  = true;
        lastValidTofMs = now;
      }
    }
  }
  if (distanceValid && (now - lastValidTofMs) > TOF_STALE_MS) {
    distanceValid = false;
    tofBufCount   = 0;
    LOG_RT("[TOF] invalid: raw=%d st=%d sig=%u -> NECUNOSCUT (fail-safe)\n",
           tofLastRaw, tofLastStatus, tofLastSignal);
  }
  // Senzor MUT pe I2C (nici măcar dataReady de TOF_RECOVER_MS): marcat absent —
  // maintTask (core 0) preia reinițializarea, fără să blocheze bucla. Un senzor
  // VIU dar fără țintă validă (status != 0, ex. spațiu liber > 4 m) NU se
  // reinițializează — fail-safe-ul de prospețime acoperă deja cazul.
  if (g_tofOk && (now - g_lastTofEventMs) > TOF_RECOVER_MS) {
    g_tofOk = false;
    LOG_RT("[TOF] mut pe I2C -> marcat absent (recuperare pe core 0)\n");
  }

  // 2b) Zona de ritm cardiac.
  if (distanceValid) {
    const HbZone z = heartbeatZone(lastDistance);
    if (z != hbZone) {
      hbZone = z;
      const char* nume = (z == ZONE_FAST)   ? "ALERT (< 0.5 m)"
                       : (z == ZONE_MEDIUM) ? "MEDIU (< 1 m)"
                       : (z == ZONE_SLOW)   ? "LENT  (< 1.5 m)"
                       :                      "OPRIT (> 1.5 m)";
      LOG_RT("[RITM] %s | distanta=%d mm\n", nume, lastDistance);
    }
  } else if (hbZone != ZONE_NONE) {
    hbZone = ZONE_NONE;
    LOG_RT("[RITM] senzor invalid -> motor OPRIT\n");
  }

  // 3) Actuatori + LED de stare la FIECARE iterație
  applyServoCommand();
  const uint32_t hbPeriod = heartbeatPeriod(hbZone);
  if (hbPeriod != 0) {
    updateHeartbeat(hbPeriod, now);
  } else {
    updateHeartbeat(0, now);
    updateVibration();
  }
  updateStatusLed(now);

  // 4) Eșantionarea IMU + publicarea telemetriei rulează în task-ul dedicat
  //    acqTask (vTaskDelayUntil, perioadă strict fixă) — nu mai sunt în loop().

  // Cedează 1 ms: toate mașinile de stări de aici au granularitate de milisecunde,
  // deci busy-spin-ul nu aducea nimic — doar 100% CPU pe core 1 (dispozitiv pe
  // baterie). Tick-ul FreeRTOS e 1 kHz => bucla rulează în continuare la ~1 kHz.
  vTaskDelay(pdMS_TO_TICKS(1));
}
